Repository: lanis-mobile/lanis-mobile
Catalog: app/lib/l10n/intl_*.arb
Languages: de

# encryptionCheckFailed
source: Encryption verification failed
de: Verschlüsselungsüberprüfung fehlgeschlagen

# unsaltedOrUnknown
source: Unsalted response error
de: Unbekannte ungesalzene Antwort

source: Not supported
de: Nicht unterstützt

# noConnection
source: No SPH connection
de: Keine SPH-Verbindung

# accountExists
source: Account already exists
de: Account existiert bereits

# copyErrorToClipboard
source: Copy error details to clipboard
de: Fehler in die Zwischenablage kopieren
