Repository: lanis-mobile/lanis-mobile
Catalog: app/lib/l10n/intl_*.arb
Languages: de

# locale
source: en_US
de: de_DE

source: Language
de: Sprache

source: Substitutions
de: Vertretungen

source: Calendar
de: Kalender

source: Calendar Week
de: Kalenderwoche

source: Messages
de: Nachrichten

source: Timetable
de: Stundenplan

source: Lessons
de: Unterricht

# storage
source: Datastorage
de: Dateispeicher

source: Settings
de: Einstellungen

# about
source: About Lanis-Mobile
de: Über Lanis-Mobile

# openLanisInBrowser
source: Open in Browser
de: Im Browser öffnen

source: Open Moodle
de: Moodle öffnen

source: User data
de: Benutzerdaten

source: Appearance
de: Aussehen

source: Notifications
de: Benachrichtigungen

source: Clear cache
de: Cache leeren

source: App information
de: App Informationen

# noSupportOpenInBrowser
source: It seems that your account or school does not directly support any features of this app! Instead, you can still open Lanis in your browser.
de: Es scheint so, als ob dein Account oder deine Schule keine Features dieser App direkt unterstützt! Stattdessen kannst du Lanis noch im Browser öffnen.

# noInternetConnection2
source: No internet connection!
de: Keine Internetverbindung!

# couldNotLoadDataStorage
source: Failed to load Datastorage!
de: Fehler beim laden vom Dateispeicher!

# couldNotLoadFiles
source: Failed to load files!
de: Fehler beim laden der Dateien!

# lanisDownError
source: Lanis is down!
de: Lanis ist nicht aufrufbar!

# lanisDownErrorMessage
source: Looks like Lanis is down. Please check the status of Lanis (PaedOrg) on the Website.
de: Anscheinend ist Lanis nicht verfügbar. Bitte überprüfe den Status von Lanis (PaedOrg) auf der Website.

# reportError
source: A problem occurred. Please report it in case of repeated occurrence.
de: Es gab wohl ein Problem, bitte melde den Fehler bei wiederholtem Auftreten.

# errorOccurred
source: An error occurred
de: Ein Fehler ist aufgetreten.

# errorOccurredWebsite
source: An error occurring while accessing the website!
de: Ein Fehler ist beim Öffnen der Seite aufgetreten!

source: No results
de: Keine Ergebnisse

source: Theme
de: Thema

source: Light
de: Hell

source: Dark
de: Dunkel

# amoledMode
source: AMOLED / Midnight mode
de: AMOLED / Mitternachts modus

source: Accent color
de: Akzent Farbe

source: Standard
de: Standart

# dynamicColor
source: Dynamic
de: Dynamisch

source: Update interval
de: Aktualisierungsintervall

source: files
de: Dateien

source: file
de: Datei

# calendarFormatMonth
source: Week
de: Woche

# calendarFormatTwoWeeks
source: Month
de: Monat

# calendarFormatWeek
source: two Weeks
de: zwei Wochen

source: No data found.
de: Keine Daten gefunden.

source: No courses found.
de: Keine Kurse gefunden.

source: Attendances
de: Anwesenheiten

source: All attendances
de: Alle Anwesenheiten

source: For this account
de: Für diesen Account

# toSemesterOne
source: Semester 1
de: Halbjahr 1

source: Homework
de: Hausaufgabe

# homeworkSaving
source: Homework is being saved...
de: Hausaufgabe wird gespeichert...

# homeworkSavingError
source: Error when saving the homework.
de: Fehler beim Speichern der Hausaufgabe.

source: Error
de: Fehler

source: History
de: Historie

source: Performance
de: Leistungen

source: Comment
de: Kommentar

source: Exams
de: Klausuren

source: No further entries!
de: Keine weiteren Einträge!

source: No Entries!
de: Keine Einträge!

# substitutionsEndCardMessage
source: Not correct? Check whether your filter is set correctly. You may need to contact your school's IT department. Last edited: {time}
de: Nicht richtig? Überprüfe, ob dein Filter richtig eingestellt ist. Eventuell solltest du dich an die IT-Abteilung deiner Schule wenden. Letzte Aktualisierung: {time}

# substitutionsLastEdit
source: Last edit: {time}
de: Letzte Aktualisierung: {time}

# substitutionsInformationMessage
source: There is information available for this day
de: Es liegen Anmerkungen zu diesem Tag vor

# logoutConfirmation
source: Do you really want to log out?
de: Bist du sicher, dass du dich abmelden möchtest?

# checkStatus
source: Check server status
de: Serverstatus überprüfen

source: Loading...
de: Lade...

source: Teacher
de: Lehrer

source: Clear all
de: Alles löschen

source: Back
de: Zurück

source: Create
de: Erstellen

source: Refresh
de: Aktualisieren

# logInTitle
source: Logging in
de: Anmeldung

# logIn
source: Authenticate
de: Anmelden

source: Select school
de: Schule auswählen

# authUsernameHint
source: firstname.surname (or abbreviation)
de: vorname.nachname (oder Kürzel)

# authPasswordHint
source: Password
de: Passwort

# authValidationError
source: Please fill in this field.
de: Bitte fülle dieses Feld aus.

# authIAccept
source: I accept the
de: Ich stimme der

# authTermsOfService
source: Privacy policy
de: Datenschutzerklärung

# authOfLanisMobile
source: of Lanis-Mobile
de: von lanis-mobile zu.

# authResetPassword
source: Reset password
de: Passwort zurücksetzen

# authFailedLoadingSchools
source: Failed to load schools. Retrying in 10 seconds...
de: Fehler beim Laden der Schulen. Erneut versuchen in 10 Sekunden...

source: Save file
de: Datei speichern

source: Open file
de: Datei öffnen

source: Share file
de: Datei teilen

source: Unknown File
de: Unbekannte Datei

# settingsInfoUserData
source: All user data is stored on the Lanis servers.
de: Alle Benutzerdaten sind auf den Lanis-Servern gespeichert.

# settingsInfoNotifications
source: The frequency and time at which everything is updated depends on various factors relating to the end device.
de: Die Häufigkeit und der Zeitpunkt der Aktualisierung hängen von verschiedenen Faktoren des Endgeräts ab.

# settingsInfoClearCache
source: All files that you have ever downloaded form the cache. You can empty it here to free up storage space. Documents older than 7 days are automatically deleted.
de: Alle Dateien, die du jemals heruntergeladen hast bilden den Cache. Hier kannst du ihn leeren um Speicherplatz freizugeben. Dateien werden automatisch nach 7 Tagen gelöscht.

# settingsUnsupportedInfoAppearance
source: Missing an option? Dynamic accent colours are not supported on iOS or older Android devices.
de: Vermisst du eine Option? Dynamische Akzentfarben werden unter iOS oder älteren Android-Versionen nicht unterstützt.

# settingsInfoDynamicColor
source: Depending on your Android-System you can change your dynamic accent colour. Normally it's always a colour from your wallpaper.
de: Je nach Androidsystem kannst du die dynamische Akzentfarbe in den Systemeinstellungen ändern. Normalerweise ist sie immer eine Farbe aus deinem Hintergrundbild.

# settingsErrorAbout
source: Normally you would see contributors but an error occurred. Most likely you don't have an internet connection.
de: Normalerweise sollten die Mitwirkenden der App angezeigt werden, aber ein Fehler ist aufgetreten. Du hast sehr wahrscheinlich keine Internetverbindung.

source: Use notifications
de: Benachrichtigungen verwenden

# intervalAppletsList
source: Background service, Applets
de: Hintergrunddienst, Applets

# darkModeColoursList
source: Dark mode, Accent colours
de: Dunkler Modus, Akzentfarben

# ageNameClassList
source: Age, name, class
de: Alter, Name, Klasse

# contributorsLinksLicensesList
source: Contributors, links, licenses
de: Mitwirkende, Links, Lizenzen

# deniedNotificationPermissions
source: You didnâ€™t authorise notifications!
de: Du hast Benachrichtigungen nicht zugelassen!

source: Open system settings
de: Systemeinstellungen öffnen

source: For every account
de: Für jeden Account

# otherSettingsAvailablePart1
source: Other settings are available in the
de: Andere Einstellungen sind in den

# otherStorageSettingsAvailablePart1
source: Other storage settings, like deleting the whole app storage, can be found in the
de: Andere Speichereinstellungen, z. B. zurücksetzen des App-Speichers, können in den

source: system settings
de: Systemeinstellungen

# questionPermanentlyEmptyCache
source: Do you want to permanently empty your cache?
de: Möchtest du den Cache wirklich unwiderruflich leeren?

# cacheEmpty
source: Cache is empty!
de: Der Cache ist leer!

source: Space used
de: Verbrauchter Speicherplatz

source: More information
de: Mehr Informationen

source: Feature request
de: Feature-Anfrage

source: Latest release
de: Neuste Version

source: Privacy policy
de: Datenschutzerklärung

source: Open-Source licenses
de: Open-Source Lizenzen

source: Build information
de: Build Informationen

# introWelcomeTitle
source: Welcome
de: Willkommen

# introForStudentsByStudentsTitle
source: By students for students
de: Von Schülern. Für Schüler.

# introCustomizeTitle
source: Customization
de: Anpassung

# introSchoolPortalTitle
source: The school portal Hesse
de: Das Schulportal Hessen

# introAnalyticsTitle
source: Troubleshooting and analysis
de: Fehlerbehebungen und Analyse

# introHaveFunTitle
source: What are you waiting for?
de: Worauf wartest du?

# introWelcome
source: lanis-mobile helps with the daily tasks of the school portal. Whether substitution plan or calendar, news or course booklets. With lanis-mobile you can learn more efficiently and easily.
de: lanis-mobile hilft bei den täglichen Aufgaben des Schulportals. Ob Vertretungsplan oder Kalender, Nachrichten oder Kurshefte. Mit lanis-mobile kannst du effizienter und einfacher lernen.

# introForStudentsByStudents
source: This application is developed by students who use the school portal Hessen. Join us on our journey! We are always looking for new collaborators! Thanks to all developers and bug reporters!
de: Diese Anwendung wird von Schülern entwickelt, die das Schulportal Hessen nutzen. Wir sind immer auf der Suche nach neuen Entwicklern! Dank an alle Entwickler und Bug Reporter!

# introCustomize
source: You can customize the app to your needs in the settings.
de: In den Einstellungen kannst du die App auf deine Bedürfnisse anpassen.

# introSchoolPortal
source: The school portal has a modular structure. This means that your school may not support all the features of the app or the app may not support all the features of your school.
de: Das Schulportal ist Modular aufgebaut. Das bedeutet, dass deine Schule vielleicht nicht alle Features der App unterstützt oder die App nicht alle Features deiner Schule.

# introAnalytics
source: Due to the modular nature of the school portal, there may be occasional problems for your school. In this case, please send us a bug report via GitHub or E-Mail.
de: Wegen der modularen Natur des Schulportals kann es vereinzelt zu Problem für deine Schule kommen. Sende uns in diesem Fall bitte einen Fehlerbericht.

# introHaveFun
source: Login now to use lanis-mobile. Use the login credentials that you normally use for the school portal website.
de: Melde dich jetzt an um lanis-mobile zu nutzen. Verwende dafür die Logindaten, die du Normalerweise für die Webseite des Schulportals verwendest.

# startupError
source: Critical error!
de: Kritischer Fehler!

# startupErrorMessage
source: A critical error occurred during the login! You can retry it or report the bold error message.
de: Ein kritischer Fehler ist während dem Login aufgetreten! Du kannst es erneut versuchen oder melde den fett geschriebenen Fehler.

# startUpMessage1
source: If you like the project, have a look at GitHub!
de: Wenn dir das Projekt gefällt, dann schau doch mal auf GitHub vorbei!

# startUpMessage2
source: Did you know that Lanis-Mobile is being developed by people like you, students?
de: Wusstest du schon, dass Lanis-Mobile von Leuten wie dir, Schülern, entwickelt wird?

# startUpMessage3
source: You can easily reduce the substitution plan to your own courses under the filter menu.
de: Du kannst den Vertretungsplan ganz einfach unter dem Filter-Menü auf deine eigenen Kurse reduzieren.

# startUpMessage4
source: If you like the app, please rate us on Google Play or the App Store.
de: Wenn dir die App gefällt, dann bewerte uns doch auf Google Play oder im App Store.

# startUpMessage5
source: Is there anything missing from the app? Can something be made better? Just write to us via GitHub Issues. Even small things are important.
de: Fehlt etwas an der App? Kann etwas besser gemacht werden? Schreibe uns einfach über GitHub Issues. Auch kleine Dinge sind wichtig.

# startUpMessage6
source: Lanis-Mobile is now used by people at over 200 schools throughout Hesse.
de: Lanis-Mobile wird inzwischen von Leuten an über 200 Schulen in ganz Hessen verwendet.

# startUpMessage7
source: Thank you for using Lanis-Mobile.
de: Danke, dass du Lanis-Mobile verwendest.

# startUpMessage8
source: Lanis-Mobile is open source and developed by students. If you would like to help, please have a look at GitHub.
de: Lanis-Mobile ist Open Source und wird von Schülern entwickelt. Wenn du helfen möchtest, dann schau doch mal auf GitHub vorbei.

# startUpMessage9
source: You can customize the app to your needs in the settings.
de: Du kannst die App auf deine Bedürfnisse anpassen. Schau doch mal in den Einstellungen vorbei.

# searchHint
source: Subject, teacher, date, ...
de: Betreff, Lehrer, Datum, Kürzel, ...

# individualSearchHint
source: {individualSearchHint, select, subject{Subject...} schedule{Date...} name{Teacher...} other{Fehler}}
de: {individualSearchHint, select, subject{Betreff...} schedule{Datum...} name{Lehrer...} other{Fehler}}

# conversationHide
source: Hide
de: Ausblenden

# hideNote
source: If the conversation receives new replies, it will be shown again. After every receiver hides it, it will be deleted.
de: Wenn wieder auf die Konversation geantwortet wird, blendet die sich wieder ein. Nachdem alle die Nachricht ausgeblendet haben, wird die gelöscht.

source: Conversation Type
de: Konversationsart

source: Experimental
de: Experimentell

# conversationTypeDescription
source: {conversationTypeDescription, select, noAnswerAllowed{Replies won't be possible.} privateAnswerOnly{Replies can only be seen by you.} groupOnly{Replies can be seen by everyone.} openChat{Replies can be seen by everyone or only specific people. The latter is currently not possible in the app.} other{Error}}
de: {conversationTypeDescription, select, noAnswerAllowed{Antworten sind nicht möglich.} privateAnswerOnly{Antworten können nur von dir gesehen werden.} groupOnly{Antworten können von jeden gesehen werden.} openChat{Antworten können von jeden oder nur von bestimmten Personen gesehen werden, was aktuell in der App nicht möglich ist.} other{Fehler}}

# conversationTypeName
source: {conversationTypeName, select, noAnswerAllowed{Hint} privateAnswerOnly{Notice} groupOnly{Group Chat} openChat{Open Chat} other{Fehler}}
de: {conversationTypeName, select, noAnswerAllowed{Hinweis} privateAnswerOnly{Mitteilung} groupOnly{Gruppenchat} openChat{Offener Chat} other{Fehler}}

# createNewConversation
source: New Conversation
de: Neue Konversation

source: Subject
de: Betreff

source: Select
de: Auswählen

# addReceivers
source: Add receiver
de: Empfänger hinzufügen

# addReceiversHint
source: e. g. names or abbreviations
de: z. B. Namen oder Abkürzungen

# sendMessagePlaceholder
source: Write your message here...
de: Schreibe hier deine Nachricht...

source: New message
de: Neue Nachricht

# openChatWarning
source: Currently in the app you can only write messages to everyone. Normally you also could write to specific people if you have the required permissions.
de: Aktuell kann man in der App nur an allen Personen eine Nachricht schicken. Normalerweise könnte man auch nur an bestimmten Personen schreiben, wenn man die Berechtigung dafür hat.

# privateConversation
source: can only see your message!
de: kann nur deine Nachrichten sehen!

# copiedMessage
source: Message was copied!
de: Nachricht wurde kopiert!

# errorSendingMessage
source: Error occurred during sending the message!
de: Nachricht konnte nicht gesendet werden!

# errorCreatingConversation
source: Couldn't create new conversation!
de: Es konnte keine neue Konversation erstellt werden!

source: Receivers
de: Empfänger

source: Participants
de: Teilnehmer

source: Supervisors
de: Betreuer

source: Parents
de: Eltern

source: Known receivers
de: Bekannte Empfänger

source: No person found!
de: Keine Person gefunden!

source: Hide/Show conversations
de: Konversationen aus-/einblenden

source: Simple search
de: Einfache Suche

source: Advanced search
de: Erweiterte Suche

source: Show all
de: Zeige alle

source: Show only visible
de: Zeige nur eingeblendete

source: Hide/Show
de: Aus-/Einblenden

# conversationNote
source: By long-pressing a conversation you can hide or show it. If every receiver hides it, it will be deleted and when new activity occurs, it will be shown again.
de: Durch das Gedrückthalten einer Konversation, kannst du sie aus-/einblenden. Sie wird gelöscht, wenn alle sie ausgeblendet haben, bei neuer Aktivität jedoch wieder eingeblendet.

source: Substitutions filter
de: Vertretungsplan Filter

source: Reset
de: Zurücksetzen

source: How it works
de: Wie es Funktioniert

# howItWorksText
source: If you add a filter, only the entries that contain the filter are displayed. If you add several filters, only the entries that contain all/one of the filters are displayed. The automatic configuration must be done per school. (Add yours if it does not work).
de: Wenn du einen Filter hinzufügst, werden nur die Einträge angezeigt, die den Filter enthalten. Wenn du mehrere Filter hinzufügst, werden nur die Einträge angezeigt, die alle/einen der Filter enthalten. Die automatische Konfiguration muss pro Schule durchgeführt werden. (Füge deine hinzu, wenn es nicht funktioniert.)

source: Add filter
de: Filter hinzufügen

source: Try again
de: Erneut versuchen

# noAppToOpen
source: Lanis-Mobile could not find any App to open the specified File in.
de: Lanis-Mobile konnte keine App finden, um die angegebene Datei zu öffnen.

# searchSchools
source: Search by name, city or id
de: Suche nach Name, Ort oder Schulnummer

source: No schools found.
de: Keine Schulen gefunden.

# schoolCountString
source: {count, plural, =0{No schools} one{1 school} other{{count} schools}}
de: {count, plural, =0{Keine Schulen} one{1 Schule} other{{count} Schulen}}

# timetableSwitchToPersonal
source: Switch to Personal timetable
de: Wechsel zum Persönlichen Stundenplan

# timetableSwitchToClass
source: Switch to Class timetable
de: Wechsel zum Klassen Stundenplan

# timetableAllWeeks
source: All Weeks
de: Gesamtplan

# timetableWeek
source: {week}-Week
de: {week}-Woche

# dateWithHours
source: {date}, {hours} Hours
de: {date}, {hours} Stunde

source: Contributors
de: Mitwirkende

# becomeContributor
source: Become a contributor
de: Werde Mitwirkender!

source: Done
de: Fertig

source: Update available
de: Update verfügbar

source: Install
de: Installieren

# notificationPermanentlyDenied
source: Please activate notifications in the app settings.
de: Bitte erlaube Benachrichtigungen für diese App.

source: Open
de: Öffnen

source: Close
de: Schließen

source: Study groups
de: Lerngruppen

# daysUntilNextExam
source: {days, plural, =0{Today} one{1 day} other{{days} days}} until the next exam
de: {days, plural, =0{Heute} one{1 Tag} other{{days} Tage}} bis zur nächsten Klausur

# daysUntilExam
source: {days, plural, =0{Today is the exam.} one{1 day until the exam.} other{{days} days until the exam.}}
de: {days, plural, =0{Heute ist die Klausur.} one{1 Tag bis zur Klausur.} other{{days} Tage bis zur Klausur.}}

# daysSinceExam
source: {days, plural, one{1 day has passed.} other{{days} days have passed.}}
de: {days, plural, one{1 Tag ist vergangen.} other{{days} Tage sind vergangen.}}

source: Background service
de: Hintergrunddienst

source: Time period
de: Zeitraum

source: Calendar export
de: Kalender-Export

# calendarExportHint
source: Please select the format you would like to export your calendar in. Note that some information can't be exported.
de: Wähle das Format aus, in dem du den Kalender exportieren möchtest. Wichtig zu wissen ist, dass nicht alle Informationen exportiert werden können.

# dayWeekYearsList
source: Day, week, years
de: Tag, Woche, Jahre

# updatesYearsImportableList
source: Automatic updates, years, importable
de: Automatische Aktualisierungen, Jahre, importierbar

# yearsImportableList
source: Years, importable
de: Jahre, importierbar

source: Day
de: Tag

source: Today
de: Heute

source: Tomorrow
de: Morgen

source: Week
de: Woche

source: Current week
de: Aktuelle Woche

source: Next week
de: Nächste Woche

source: Shortened calendar
de: Kurz-Kalender

# extendedCalendar
source: Calendar with event descriptions
de: Kalender mit Terminbeschreibungen

source: Wall calendar
de: Wandkalender

source: short
de: kurz

source: extended
de: erweitert

source: wall
de: wand

source: Subscription
de: Abonnement

# subscriptionHint
source: You can import this link into your calendar app to have an automatically updating calendar. It will also cover multiple years. Keep this link private because it can be used by anyone.
de: Du kannst diesen Link in deine Kalender-App importieren, um einen automatisch aktualisierenden Kalender zu haben. Er ist auch jahresübergreifend. Halte diesen Link geheim, da er von jeden benutzt werden kann.

# linkCopied
source: Link was copied!
de: Link wurde kopiert!

# feedback
source: Feedback for the App 👉👈
de: Feedback zur App 👉👈

source: In this update
de: In diesem Update

# showReleaseNotesForThisVersion
source: Release notes for this version
de: Versionshinweise für diese Version

source: Reset account
de: Account zurücksetzen

source: Wrong password!
de: Falsches Passwort

# wrongPasswordHint
source: Your password seems to be incorrect! This can happen if you have changed your password on another device or if your account has been deleted. Either change your password (enter your new password here) or delete your account entirely to resolve this issue.
de: Ihr Passwort scheint falsch zu sein! Dies kann passieren, wenn Sie Ihr Passwort auf einem anderen Gerät geändert haben oder wenn Ihr Konto gelöscht wurde. Ändern Sie entweder Ihr Passwort (geben Sie hier Ihr neues Passwort ein) oder löschen Sie Ihr Konto vollständig, um dieses Problem zu beheben.

source: Change password
de: Passwort ändern

source: Remove account
de: Account entfernen

source: Customize Timetable
de: Stundenplan anpassen

# customizeTimetableDescription
source: Hidden lessons, custom lessons
de: Ausgeblendete Stunden, eigene Stunden

# customizeTimetableDisclaimer
source: After you make a change you need to restart the app or switch applets to see the changes.
de: Nachdem du Änderungen vorgenommen hast, musst du die App neu starten oder das Applet wechseln.

source: Lesson name
de: Stundenname

source: required
de: benötigt

source: Room
de: Raum

# lessonAdded
source: Lesson {lesson} added!
de: Stunde {lesson} wurde hinzugefügt!

source: Add lesson
de: Stunde hinzufügen

source: Edit lesson
de: Stunde bearbeiten

source: Hidden lessons
de: Ausgeblendete Stunden

# hiddenLessonsDescription
source: There are no hidden lessons for this day. You can hide lessons in the timetable
de: Es gibt keine ausgeblendeten Stunden. Du kannst Stunden im Stundenplan ausblenden.

source: Custom lessons
de: Eigene Stunden

source: Clear
de: Zurücksetzen

source: Unknown lesson
de: Unbekannte Stunde

# lessonHidden
source: {lesson} was hidden. To show it again, you need to remove it in the settings.
de: {lesson} wurde ausgeblendet! Du kannst diese in den Einstellungen wieder einblenden.

source: Wrong credentials!
de: Falsche Anmeldedaten!

# lanisDown
source: Lanis is down!
de: Lanis ist nicht erreichbar!

# loginTimeout
source: Wait {time} before next attempt
de: Warte {time} vor nächstem Versuch

# credentialsIncomplete
source: Missing credentials
de: Anmeldedaten unvollständig

source: Network error
de: Netzwerkfehler

source: Unknown error
de: Unbekannter Fehler

source: Unauthorized
de: Keine Erlaubnis
